ERROR_MESSAGES = {
    "invalid_base64": "Некорректный формат base64 изображения",
    "invalid_image_format": "Неподдерживаемый формат изображения",
    "invalid_base64_data": "Некорректные base64 данные",
    "ingredient_not_found": "Ингредиент с указанным id не существует",
    "ingredient_duplicate": "Ингредиенты не должны повторяться",
    "no_ingredients": "Необходимо указать хотя бы один ингредиент",
    "empty_ingredients": "Список ингредиентов не может быть пустым",
}


ERRORS = {
    "self_subscribe": "Нельзя подписаться на самого себя!",
    "already_subscribed": "Вы уже подписаны на этого пользователя!",
    "not_subscribed": "Вы не подписаны на этого пользователя!",
    "already_in_favorites": "Рецепт уже в избранном!",
    "not_in_favorites": "Рецепт не в избранном!",
    "already_in_cart": "Рецепт уже добавлен в корзину!",
    "not_in_cart": "Рецепт не в корзине!",
    "no_subscriptions": "Вы ни на кого не подписаны.",
    "no_image": "Необходимо загрузить изображение",
    "cant_edit": "Вы не можете изменять чужие рецепты",
    "cant_delete": "Вы не можете удалять чужие рецепты",
}
